sipeed/M1s_BL808_SDK/components/platform/soc/bl808/startup_bl808/evb/d0/start_load_d0.c
#include <stdint.h>
#include "bl606p_glb.h"

#define __STARTUP_CLEAR_BSS             1

/*----------------------------------------------------------------------------
  Linker generated Symbols
 *----------------------------------------------------------------------------*/
extern uint32_t __itcm_load_addr;
extern uint32_t __dtcm_load_addr;
extern uint32_t __system_ram_load_addr;
extern uint32_t __ram_load_addr;

extern uint32_t __text_code_start__;
extern uint32_t __text_code_end__;
extern uint32_t __tcm_code_start__;
extern uint32_t __tcm_code_end__;
extern uint32_t __tcm_data_start__;
extern uint32_t __tcm_data_end__;
extern uint32_t __system_ram_data_start__;
extern uint32_t __system_ram_data_end__;
extern uint32_t __ram_data_start__;
extern uint32_t __ram_data_end__;
extern uint32_t __bss_start__;
extern uint32_t __bss_end__;
extern uint32_t __noinit_data_start__;
extern uint32_t __noinit_data_end__;

extern uint32_t __StackTop;
extern uint32_t __StackLimit;
extern uint32_t __HeapBase;
extern uint32_t __HeapLimit;

//extern uint32_t __copy_table_start__;
//extern uint32_t __copy_table_end__;
//extern uint32_t __zero_table_start__;
//extern uint32_t __zero_table_end__;

#if defined(DUAL_CORE)
volatile uintptr_t ATTR_MP_SHARE_DATA_SECTION master_copy_done = 0;
#endif

void start_load(void) {
    uint32_t *pSrc, *pDest;
    uint32_t *pTable __attribute__((unused));  

#if defined(DUAL_CORE)
    __DSB();
    if (CORE_ID_D1 == BL_RD_WORD(CORE_ID_ADDRESS)) {
        /* TODO: spin here with WFE(WFI) */
        do{
            __NOP();
        } while(master_copy_done != 0xDEAD5501);
        __ISB();
        __DSB();
        return;
    }
#endif

    /* Copy ITCM code */
    pSrc  = &__itcm_load_addr;
    pDest = &__tcm_code_start__;
    for ( ; pDest < &__tcm_code_end__ ; ) {
        *pDest++ = *pSrc++;
    }

    /* Copy DTCM code */
    pSrc  = &__dtcm_load_addr;
    pDest = &__tcm_data_start__;
    for( ; pDest < &__tcm_data_end__; ){
        *pDest++ = *pSrc++;
    }

    /* BF Add system RAM data copy */
    pSrc  = &__system_ram_load_addr;
    pDest = &__system_ram_data_start__;
    for ( ; pDest < &__system_ram_data_end__ ; ) {
        *pDest++ = *pSrc++;
    }

    /* BF Add OCARAM data copy */
    pSrc  = &__ram_load_addr;
    pDest = &__ram_data_start__;
    for ( ; pDest < &__ram_data_end__ ; ) {
        *pDest++ = *pSrc++;
    }

#ifdef __STARTUP_CLEAR_BSS
    /*  Single BSS section scheme.
     *
     *  The BSS section is specified by following symbols
     *    __bss_start__: start of the BSS section.
     *    __bss_end__: end of the BSS section.
     *
     *  Both addresses must be aligned to 4 bytes boundary.
     */
    pDest = &__bss_start__;
    for ( ; pDest < &__bss_end__ ; ) {
        *pDest++ = 0ul;
    }
#endif 

    csi_dcache_clean();

#if defined(DUAL_CORE)
    __DSB();
    if (GLB_CORE_ID_D0 == GLB_Get_Core_Type()) {
        master_copy_done = 0xDEAD5501;
    }
    __DSB();
#endif
}
